@echo off
chcp 936>nul
setlocal enabledelayedexpansion
set ver=4.2.740.1

title 获取更新 ID 简易工具 v%ver%
echo.===============================================================================================
echo.                                    获取更新 ID 简易工具
echo.===============================================================================================
echo.更新 ID 现已不再通过 UUP dump 的各大主要页面单列提供，因此在多数情况下，你需要通过填写完整选择
echo.语言页面地址获得对应版本更新 ID。
echo.此工具是一个简易工具，用于通过版本选择语言页面地址获得更新 ID。
echo.在 UUP dump 页面上，右键单击你要使用版本对应的超链接，选择复制链接，即可获得此版本的语言选择页
echo.面地址。
echo.
echo.===============================================================================================
echo.地址示例：https://uupdump.net/selectlang.php?id=a1b2c3d4-123b-1a2b-a3b4-1a2b3c4d5e6f
echo.===============================================================================================
echo.
set /p UUPurl=请输入含有更新 ID 的 UUP dump 地址：
set UUPurl=%UUPurl%
set TMPLIST=%UUPurl%

set /a NUM=1
:loop
for /f "tokens=1* delims==" %%a in ("%TMPLIST%") do (

if %NUM% equ 2 (
cls
echo.===============================================================================================
echo.                                          操 作 成 功
echo.===============================================================================================
echo.
echo.
echo 已完成，你的更新 ID 是：%%a
echo.
echo.
echo.===============================================================================================
) else (
cls
echo.===============================================================================================
echo.                                          操 作 失 败
echo.===============================================================================================
echo.
echo.
echo 抱歉，你输入的不是合法的 UUP dump 地址。
echo.
echo.
echo.===============================================================================================
)

set /a NUM=NUM+1

set TMPLIST=%%b
)

if defined TMPLIST goto :loop

endlocal

echo 请按任意键退出脚本。
pause>nul

exit /b